/* ======================================================
   TYPE
====================================================== */
type News = {
  id: number;

  // 🔥 แก้ตรงนี้ (สำคัญ)
  categoryTH: string;
  categoryEN: string;

  titleTH: string;
  titleEN: string;
  detailTH: string;
  detailEN: string;

  createdAt: string;
  images: string[];
};

/* ======================================================
   API
====================================================== */
export async function GET() {
  const news: News[] = [
    {
      id: 1,
      categoryTH: "ข่าวสาร",
      categoryEN: "News",
      titleTH: "บริษัท ศักดิ์สยามลิสซิ่ง จำกัด (มหาชน) ดำเนินการเป็นเจ้าภาพในงานทอดกฐินสามัคคี ณ วัดห้องสูง",
      titleEN: "New Branch Opening",
      detailTH: "เมื่อวันที่ 9-10 พฤศจิกายน 2567 ผู้ช่วยศาสตราจารย์ ดร.พูนศักดิ์ บุญสาลี  ประธานกรรมการบริหาร  อาจารย์จินตนา บุญสาลี กรรมการบริหาร และพนักงาน นำคณะกฐิน บริษัท ศักดิ์สยามลิสซิ่ง จำกัด (มหาชน) ดำเนินการเป็นเจ้าภาพในงานทอดกฐินสามัคคี ณ วัดห้องสูง ตำบลชัยจุมพล อำเภอลับแล จังหวัดอุตรดิตถ์",
      detailEN: "Opening new branch to serve customers",
      createdAt: "2026-03-25",
      images: [
        "/New/New1/20241113-04-01.jpg",
        "/New/New1/20241113-04-02.jpg",
        "/New/New1/20241113-04-03.jpg",
        "/New/New1/20241113-04-04.jpg",
      ],
    },
    {
      id: 2,
      categoryTH: "กิจกรรม",
      categoryEN: "Activities",
      titleTH: "จัดซื้อรถไฟฟ้า จำนวน 2 คัน และสร้างสถานีรถไฟฟ้า 1 สถานี เพื่อสนับสนุนการจัดตั้งโรงพยาบาลอุตรดิตถ์ 3",
      titleEN: "CSR Activity",
      detailTH: "ผู้ช่วยศาสตราจารย์ ดร.พูนศักดิ์ บุญสาลี  ประธานกรรมการบริหาร  บริษัท ศักดิ์สยามลิสซิ่ง จำกัด (มหาชน) มอบเงินจำนวน 12,196,000 บาท ด้วยทุนทรัพย์ส่วนตัว ในการจัดซื้อรถไฟฟ้า จำนวน 2 คัน และสร้างสถานีรถไฟฟ้า 1 สถานี เพื่อสนับสนุนการจัดตั้งโรงพยาบาลอุตรดิตถ์ 3 : ศูนย์เวชศาสตร์ฟื้นฟูและดูแลผู้สูงอายุ มหาวิทยาลัยราชภัฏอุตรดิตถ์ (ศว.สอ.) ทุ่งกะโล่",
      detailEN: "Supporting local communities",
      createdAt: "2026-03-24",
      images: [
        "/New/New2/20241101-03-01.jpg",
        "/New/New2/20241101-03-02.jpg",
        "/New/New2/20241101-03-03.jpg",
      ],
    },
    {
      id: 3,
      categoryTH: "ข่าวสาร",
      categoryEN: "News",
      titleTH: "รางวัล CEO Econmass Awards 2024 ประเภทสุดยอดซีอีโอรุ่นใหญ่",
      titleEN: "Low Interest Promotion",
      detailTH: "คณะกรรมการบรรษัทภิบาลและความยั่งยืน บริษัท ศักดิ์สยามลิสซิ่ง จำกัด (มหาชน) ยินดีที่จะแจ้งให้ทราบว่า คุณศิวพงศ์ บุญสาลี กรรมการผู้จัดการ ได้รับรางวัล CEO Econmass Awards 2024 ประเภทสุดยอดซีอีโอรุ่นใหญ่ จากโครงการคัดเลือกสุดยอดผู้นำองค์กร (สุดยอดซีอีโอ) ประจำปี 2567 สาขาธุรกิจการเงิน โดยสมาคมผู้สื่อข่าวเศรษฐกิจ เข้ารับรางวัลจากนายกรัฐมนตรี (นางสาวแพทองธาร ชินวัตร) เมื่อวันที่ 30 ตุลาคม 2567 ณ โรงละครอักษรา คิงเพาเวอร์ กรุงเทพมหานคร",
      detailEN: "Special low interest rate",
      createdAt: "2026-03-23",
      images: [
        "/New/New3/20241101-02-01.jpg",
        "/New/New3/20241101-02-02.jpg",
        "/New/New3/20241101-02-03.jpg",
      ],
    },
    {
      id: 4,
      categoryTH: "กิจกรรม",
      categoryEN: "Activities",
      titleTH: "สถานประกอบกิจการดีเด่นด้านแรงงานสัมพันธ์และสวัสดิการแรงงาน ประจำปี 2567",
      titleEN: "Donation Activity",
      detailTH: "เมื่อวันที่ 24 ตุลาคม 2567 บริษัท​ ศักดิ์สยามลิสซิ่ง จำกัด (มหาชน) โดยคุณศิวพงศ์ บุญสาลี กรรมการผู้จัดการ รับมอบรางวัล สถานประกอบกิจการดีเด่นด้านแรงงานสัมพันธ์และสวัสดิการแรงงาน ประจำปี 2567 ระดับประเทศ เป็นปีที่ 4 จากกระทรวงแรงงาน  โดยรับมอบจาก ท่านพชรเสฏฐ์ บุญศิริสาริศา รองผู้ว่าราชการจังหวัดอุตรดิตถ์ ณ ศาลาประชาคมจังหวัดอุตรดิตถ์ อำเภอเมือง จังหวัดอุตรดิตถ์",
      detailEN: "Helping those in need",
      createdAt: "2026-03-22",
      images: [
        "/New/New4/20241101-01.jpg",
        "/New/New4/20241101-02.jpg",
        "/New/New4/20241101-03.jpg",
        "/New/New4/20241101-04.jpg",

      ],
    },
    {
      id: 5,
      categoryTH: "ข่าวสาร",
      categoryEN: "News",
      titleTH: "SAK ร่วมทุน ทีซี รีนิวอะเบิ้ล จัดตั้ง ‘ศักดิ์สยาม ทีซี เอ็นเนอร์ยี่’ รุกธุรกิจโซลาร์รูฟท็อปสำหรับที่อยู่อาศัยพร้อมให้บริการสินเชื่อ สร้างความยั่งยืนด้านพลังงาน ขับเคลื่อนเศรษฐกิจฐานราก",
      titleEN: "Nationwide Expansion",
      detailTH: "‘บมจ.ศักดิ์สยามลิสซิ่ง’ หรือ SAK ผู้ให้บริการสินเชื่อรายย่อย  ร่วมทุน ‘ทีซี รีนิวอะเบิ้ล เอ็นเนอร์ยี่’ ผู้ดำเนินธุรกิจติดตั้งระบบพลังงานแสงอาทิตย์หรือโซลาร์รูฟท็อป ตั้งบริษัท ศักดิ์สยาม ทีซี เอ็นเนอร์ยี่ จำกัด บุกธุรกิจติดตั้งระบบโซลาร์รูฟท็อป พร้อมให้บริการด้านสินเชื่อเพื่อสนับสนุนการติดตั้งโซลาร์รูฟท็อปสำหรับที่อยู่อาศัย สร้างความยั่งยืนด้านพลังงานและขับเคลื่อนเศรษฐกิจฐานราก",
      detailEN: "Expanding branches nationwide",
      createdAt: "2026-03-21",
      images: [
        "/New/New5/20230105-160515-01.jpg",
        "/New/New5/20230105-160515-02.jpg",
        "/New/New5/20230105-160518-04.jpg",
        "/New/New5/20230105-160518-05.jpg",
        "/New/New5/20230105-160518-06.jpg",
        "/New/New5/20230105-160515-07.jpg",
      ],
    },
    {
      id: 6,
      categoryTH: "กิจกรรม",
      categoryEN: "Activities",
      titleTH: "ศักดิ์สยาม จูงมือกันปันน้ำใจ ครั้งที่ 12",
      titleEN: "Children's Day Activity",
      detailTH: " เมื่อวันที่ 9 มกราคม 2567 บริษัท ศักดิ์สยามลิสซิ่ง จำกัด (มหาชน) จัดกิจกรรม “ศักดิ์สยาม จูงมือกันปันน้ำใจ ครั้งที่ 12” เนื่องในวันเด็กแห่งชาติ ประจำปี 2567 โดยมีคุณศิวพงศ์ บุญสาลี กรรมการผู้จัดการ พร้อมด้วยคณะผู้บริหารและพนักงาน ร่วมกันมอบของขวัญและเลี้ยงอาหารกลางวันให้กับเด็กๆ ณ โรงเรียนบ้านห้วยมะเกลือ ตำบลน้ำไผ่ อำเภอเมือง จังหวัดอุตรดิตถ์",
      detailEN: "Activities for children",
      createdAt: "2026-03-20",
      images: [
        "/New/New6/act65101_1_01.jpg",
        "/New/New6/act65101_1_02.jpg",
        "/New/New6/act65101_1_03.jpg",
        "/New/New6/act65101_1_04.jpg",
        "/New/New6/act65101_1_05.jpg",
        "/New/New6/act65101_1_06.jpg",
        "/New/New6/act65101_1_07.jpg",

      ],
    },
    {
      id: 7,
      categoryTH: "ข่าวสาร",
      categoryEN: "News",
      titleTH: "มอบเงินเพื่อสนับสนุนการก่อสร้างห้องปฏิบัติการคณะพยาบาลศาสตร์ มหาวิทยาลัยราชภัฎอุตรดิตถ์ จำนวน 10,000,000 บาท",
      titleEN: "New Loan Service",
      detailTH: "มอบเงินเพื่อสนับสนุนการก่อสร้างห้องปฏิบัติการคณะพยาบาลศาสตร์ มหาวิทยาลัยราชภัฎอุตรดิตถ์ จำนวน 10,000,000 บาท",
      detailEN: "Introducing new loan services",
      createdAt: "2026-03-19",
      images: [
        "/New/New7/act_0665_01.jpg",
        "/New/New7/act_0665_02.jpg",
        "/New/New7/act_0665_03.jpg",
        "/New/New7/act_0665_04.jpg",
      ],
    },
    {
      id: 8,
      categoryTH: "กิจกรรม",
      categoryEN: "Activities",
      titleTH: "ร่วมมอบสิ่งของอุปกรณ์การเรียนให้แก่ บ้านพักเด็กและครอบครัวจังหวัดอุตรดิตถ์",
      titleEN: "Tree Planting Activity",
      detailTH: "ร่วมกันปลูกร่วมมอบสิ่งของอุปกรณ์การเรียนให้แก่ บ้านพักเด็กและครอบครัวจังหวัดอุตรดิตถ์ต้นไม้",
      detailEN: "Tree planting for environment",
      createdAt: "2026-03-18",
      images: [
        "/New/New8/act_0565_01.jpg",
        "/New/New8/act_0565_02.jpg",
        "/New/New8/act_0565_03.jpg",
        "/New/New8/act_0565_04.jpg",
        "/New/New8/act_0565_05.jpg",

      ],
    },
    {
      id: 9,
      categoryTH: "ข่าวสาร",
      categoryEN: "News",
      titleTH: "อัปเดตระบบใหม่",
      titleEN: "System Upgrade",
      detailTH: "ปรับปรุงระบบให้เร็วขึ้น",
      detailEN: "Improving system performance",
      createdAt: "2026-03-17",
      images: [
        "/New/New9/act640626_2_02.jpg",
        "/New/New9/act640626_2_03.jpg",
        "/New/New9/act640626_2_04.jpg",
        "/New/New9/act640626_2_05.jpg",
        "/New/New9/act640626_2_18.jpg",

      ],
    },
    {
      id: 10,
      categoryTH: "กิจกรรม",
      categoryEN: "Activities",
      titleTH: "ศักดิ์สยาม จูงมือกัน ปันน้ำใจ ครั้งที่ 11",
      titleEN: "Team Building Activity",
      detailTH: "สร้างความสัมพันธ์ในองค์กร",
      detailEN: "Building team relationships",
      createdAt: "2026-03-16",
      images: [
        "/New/New10/act640625_1_01.jpg",
        "/New/New10/act640625_1_02.jpg",
        "/New/New10/act640625_1_03.jpg",
        "/New/New10/act640625_1_04.jpg",
        "/New/New10/act640625_1_05.jpg",
        "/New/New10/act640625_1_06.jpg",
      ],
    },
  ];

  return Response.json({ news });

}
